program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}})]
{
    func main<ios17>(tensor<fp16, [1, 80, 1, 3000]> melspectrogram_features) {
            tensor<int32, [2]> var_90 = const()[name = tensor<string, []>("op_90"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_96 = const()[name = tensor<string, []>("op_96"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_101 = const()[name = tensor<string, []>("op_101"), val = tensor<int32, []>(1)];
            tensor<string, []> var_106_pad_type_0 = const()[name = tensor<string, []>("op_106_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_106_pad_0 = const()[name = tensor<string, []>("op_106_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<fp16, [1280, 80, 1, 3]> var_81_to_fp16 = const()[name = tensor<string, []>("op_81_to_fp16"), val = tensor<fp16, [1280, 80, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1280]> var_87_to_fp16 = const()[name = tensor<string, []>("op_87_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(614528)))];
            tensor<fp16, [1, 1280, 1, 3000]> var_106_cast_fp16 = conv(bias = var_87_to_fp16, dilations = var_96, groups = var_101, pad = var_106_pad_0, pad_type = var_106_pad_type_0, strides = var_90, weight = var_81_to_fp16, x = melspectrogram_features)[name = tensor<string, []>("op_106_cast_fp16")];
            tensor<string, []> hidden_states_1_mode_0 = const()[name = tensor<string, []>("hidden_states_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 1, 3000]> hidden_states_1_cast_fp16 = gelu(mode = hidden_states_1_mode_0, x = var_106_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<int32, [2]> var_130 = const()[name = tensor<string, []>("op_130"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_136 = const()[name = tensor<string, []>("op_136"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, []>(1)];
            tensor<string, []> var_146_pad_type_0 = const()[name = tensor<string, []>("op_146_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_146_pad_0 = const()[name = tensor<string, []>("op_146_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<fp16, [1280, 1280, 1, 3]> var_121_to_fp16 = const()[name = tensor<string, []>("op_121_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(617152)))];
            tensor<fp16, [1280]> var_127_to_fp16 = const()[name = tensor<string, []>("op_127_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10447616)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_146_cast_fp16 = conv(bias = var_127_to_fp16, dilations = var_136, groups = var_141, pad = var_146_pad_0, pad_type = var_146_pad_type_0, strides = var_130, weight = var_121_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_146_cast_fp16")];
            tensor<string, []> hidden_states_3_mode_0 = const()[name = tensor<string, []>("hidden_states_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 1, 1500]> hidden_states_3_cast_fp16 = gelu(mode = hidden_states_3_mode_0, x = var_146_cast_fp16)[name = tensor<string, []>("hidden_states_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> var_164_to_fp16 = const()[name = tensor<string, []>("op_164_to_fp16"), val = tensor<fp16, [1, 1280, 1, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10450240)))];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_1_cast_fp16 = add(x = hidden_states_3_cast_fp16, y = var_164_to_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_178 = const()[name = tensor<string, []>("op_178"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_180 = const()[name = tensor<string, []>("op_180"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_181 = const()[name = tensor<string, []>("op_181"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_191 = const()[name = tensor<string, []>("op_191"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_1_cast_fp16 = reduce_mean(axes = var_191, keep_dims = var_181, x = inputs_1_cast_fp16)[name = tensor<string, []>("channels_mean_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_1_cast_fp16 = sub(x = inputs_1_cast_fp16, y = channels_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_sq_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = zero_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_sq_1_cast_fp16")];
            tensor<int32, [1]> var_195 = const()[name = tensor<string, []>("op_195"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_196_cast_fp16 = reduce_mean(axes = var_195, keep_dims = var_181, x = zero_mean_sq_1_cast_fp16)[name = tensor<string, []>("op_196_cast_fp16")];
            tensor<fp16, []> var_197_to_fp16 = const()[name = tensor<string, []>("op_197_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_198_cast_fp16 = add(x = var_196_cast_fp16, y = var_197_to_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<fp32, []> denom_1_epsilon_0 = const()[name = tensor<string, []>("denom_1_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_1_cast_fp16 = rsqrt(epsilon = denom_1_epsilon_0, x = var_198_cast_fp16)[name = tensor<string, []>("denom_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> out_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = denom_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [1280]> obj_1_mean_0_to_fp16 = const()[name = tensor<string, []>("obj_1_mean_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14290304)))];
            tensor<fp16, [1280]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14292928)))];
            tensor<fp16, [1280]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14295552)))];
            tensor<fp16, [1280]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14298176)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<int32, [2]> var_213 = const()[name = tensor<string, []>("op_213"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_215 = const()[name = tensor<string, []>("op_215"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> query_1_pad_type_0 = const()[name = tensor<string, []>("query_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> query_1_pad_0 = const()[name = tensor<string, []>("query_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_q_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14300800))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15120064))), name = tensor<string, []>("layers_0_self_attn_q_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15120192)))];
            tensor<fp16, [1, 1280, 1, 1500]> query_1_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_bias_to_fp16, dilations = var_215, groups = var_180, pad = query_1_pad_0, pad_type = query_1_pad_type_0, strides = var_213, weight = layers_0_self_attn_q_proj_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<int32, [2]> var_219 = const()[name = tensor<string, []>("op_219"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_221 = const()[name = tensor<string, []>("op_221"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> key_1_pad_type_0 = const()[name = tensor<string, []>("key_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> key_1_pad_0 = const()[name = tensor<string, []>("key_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15122816))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15942080))), name = tensor<string, []>("layers_0_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> key_1_cast_fp16 = conv(dilations = var_221, groups = var_180, pad = key_1_pad_0, pad_type = key_1_pad_type_0, strides = var_219, weight = layers_0_self_attn_k_proj_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<int32, [2]> var_226 = const()[name = tensor<string, []>("op_226"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> value_1_pad_type_0 = const()[name = tensor<string, []>("value_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> value_1_pad_0 = const()[name = tensor<string, []>("value_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15942208))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16761472))), name = tensor<string, []>("layers_0_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16761600)))];
            tensor<fp16, [1, 1280, 1, 1500]> value_1_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_bias_to_fp16, dilations = var_228, groups = var_180, pad = value_1_pad_0, pad_type = value_1_pad_type_0, strides = var_226, weight = layers_0_self_attn_v_proj_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_232 = const()[name = tensor<string, []>("op_232"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_233_cast_fp16 = reshape(shape = var_232, x = query_1_cast_fp16)[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<fp16, []> var_234_to_fp16 = const()[name = tensor<string, []>("op_234_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 20, 64, 1500]> var_235_cast_fp16 = mul(x = var_233_cast_fp16, y = var_234_to_fp16)[name = tensor<string, []>("op_235_cast_fp16")];
            tensor<int32, [4]> var_236 = const()[name = tensor<string, []>("op_236"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_237_cast_fp16 = reshape(shape = var_236, x = key_1_cast_fp16)[name = tensor<string, []>("op_237_cast_fp16")];
            tensor<bool, []> mh_w_1_transpose_x_0 = const()[name = tensor<string, []>("mh_w_1_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_1_transpose_y_0 = const()[name = tensor<string, []>("mh_w_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 1500]> mh_w_1_cast_fp16 = matmul(transpose_x = mh_w_1_transpose_x_0, transpose_y = mh_w_1_transpose_y_0, x = var_235_cast_fp16, y = var_237_cast_fp16)[name = tensor<string, []>("mh_w_1_cast_fp16")];
            tensor<fp16, [1, 20, 1500, 1500]> var_240_cast_fp16 = softmax(axis = var_178, x = mh_w_1_cast_fp16)[name = tensor<string, []>("op_240_cast_fp16")];
            tensor<int32, [4]> var_241 = const()[name = tensor<string, []>("op_241"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_242_cast_fp16 = reshape(shape = var_241, x = value_1_cast_fp16)[name = tensor<string, []>("op_242_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_0 = const()[name = tensor<string, []>("attn_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_0 = const()[name = tensor<string, []>("attn_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 20, 64, 1500]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_0, transpose_y = attn_1_transpose_y_0, x = var_242_cast_fp16, y = var_240_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<int32, [4]> var_245 = const()[name = tensor<string, []>("op_245"), val = tensor<int32, [4]>([1, 1280, 1, -1])];
            tensor<fp16, [1, 1280, 1, 1500]> input_1_cast_fp16 = reshape(shape = var_245, x = attn_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [2]> var_249 = const()[name = tensor<string, []>("op_249"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> obj_3_pad_type_0 = const()[name = tensor<string, []>("obj_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> obj_3_pad_0 = const()[name = tensor<string, []>("obj_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_o_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16764224))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17583488))), name = tensor<string, []>("layers_0_self_attn_o_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_o_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17583616)))];
            tensor<fp16, [1, 1280, 1, 1500]> obj_3_cast_fp16 = conv(bias = layers_0_self_attn_o_proj_bias_to_fp16, dilations = var_251, groups = var_180, pad = obj_3_pad_0, pad_type = obj_3_pad_type_0, strides = var_249, weight = layers_0_self_attn_o_proj_weight_to_fp16_palettized, x = input_1_cast_fp16)[name = tensor<string, []>("obj_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = obj_3_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_3_cast_fp16 = reduce_mean(axes = var_257, keep_dims = var_181, x = inputs_3_cast_fp16)[name = tensor<string, []>("channels_mean_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_3_cast_fp16 = sub(x = inputs_3_cast_fp16, y = channels_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_sq_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = zero_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_sq_3_cast_fp16")];
            tensor<int32, [1]> var_261 = const()[name = tensor<string, []>("op_261"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_262_cast_fp16 = reduce_mean(axes = var_261, keep_dims = var_181, x = zero_mean_sq_3_cast_fp16)[name = tensor<string, []>("op_262_cast_fp16")];
            tensor<fp16, []> var_263_to_fp16 = const()[name = tensor<string, []>("op_263_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_264_cast_fp16 = add(x = var_262_cast_fp16, y = var_263_to_fp16)[name = tensor<string, []>("op_264_cast_fp16")];
            tensor<fp32, []> denom_3_epsilon_0 = const()[name = tensor<string, []>("denom_3_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_3_cast_fp16 = rsqrt(epsilon = denom_3_epsilon_0, x = var_264_cast_fp16)[name = tensor<string, []>("denom_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> out_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = denom_3_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [1280]> input_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_3_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17586240)))];
            tensor<fp16, [1280]> input_3_beta_0_to_fp16 = const()[name = tensor<string, []>("input_3_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17588864)))];
            tensor<fp16, []> input_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("input_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> input_3_cast_fp16 = batch_norm(beta = input_3_beta_0_to_fp16, epsilon = input_3_epsilon_0_to_fp16, gamma = input_3_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_3_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [2]> var_275 = const()[name = tensor<string, []>("op_275"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_277 = const()[name = tensor<string, []>("op_277"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [5120, 1280, 1, 1]> layers_0_fc1_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_fc1_weight_to_fp16"), val = tensor<fp16, [5120, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17591488)))];
            tensor<fp16, [5120]> layers_0_fc1_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc1_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30698752)))];
            tensor<fp16, [1, 5120, 1, 1500]> input_5_cast_fp16 = conv(bias = layers_0_fc1_bias_to_fp16, dilations = var_277, groups = var_180, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = var_275, weight = layers_0_fc1_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_mode_0 = const()[name = tensor<string, []>("input_7_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 5120, 1, 1500]> input_7_cast_fp16 = gelu(mode = input_7_mode_0, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [2]> var_283 = const()[name = tensor<string, []>("op_283"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_285 = const()[name = tensor<string, []>("op_285"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_5_pad_type_0 = const()[name = tensor<string, []>("hidden_states_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_5_pad_0 = const()[name = tensor<string, []>("hidden_states_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 5120, 1, 1]> layers_0_fc2_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_fc2_weight_to_fp16"), val = tensor<fp16, [1280, 5120, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30709056)))];
            tensor<fp16, [1280]> layers_0_fc2_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43816320)))];
            tensor<fp16, [1, 1280, 1, 1500]> hidden_states_5_cast_fp16 = conv(bias = layers_0_fc2_bias_to_fp16, dilations = var_285, groups = var_180, pad = hidden_states_5_pad_0, pad_type = hidden_states_5_pad_type_0, strides = var_283, weight = layers_0_fc2_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("hidden_states_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = hidden_states_5_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, []> var_296 = const()[name = tensor<string, []>("op_296"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_298 = const()[name = tensor<string, []>("op_298"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_299 = const()[name = tensor<string, []>("op_299"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_309 = const()[name = tensor<string, []>("op_309"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_5_cast_fp16 = reduce_mean(axes = var_309, keep_dims = var_299, x = inputs_5_cast_fp16)[name = tensor<string, []>("channels_mean_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_5_cast_fp16 = sub(x = inputs_5_cast_fp16, y = channels_mean_5_cast_fp16)[name = tensor<string, []>("zero_mean_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_sq_5_cast_fp16 = mul(x = zero_mean_5_cast_fp16, y = zero_mean_5_cast_fp16)[name = tensor<string, []>("zero_mean_sq_5_cast_fp16")];
            tensor<int32, [1]> var_313 = const()[name = tensor<string, []>("op_313"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_314_cast_fp16 = reduce_mean(axes = var_313, keep_dims = var_299, x = zero_mean_sq_5_cast_fp16)[name = tensor<string, []>("op_314_cast_fp16")];
            tensor<fp16, []> var_315_to_fp16 = const()[name = tensor<string, []>("op_315_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_316_cast_fp16 = add(x = var_314_cast_fp16, y = var_315_to_fp16)[name = tensor<string, []>("op_316_cast_fp16")];
            tensor<fp32, []> denom_5_epsilon_0 = const()[name = tensor<string, []>("denom_5_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_5_cast_fp16 = rsqrt(epsilon = denom_5_epsilon_0, x = var_316_cast_fp16)[name = tensor<string, []>("denom_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> out_5_cast_fp16 = mul(x = zero_mean_5_cast_fp16, y = denom_5_cast_fp16)[name = tensor<string, []>("out_5_cast_fp16")];
            tensor<fp16, [1280]> obj_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_5_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43818944)))];
            tensor<fp16, [1280]> obj_5_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_5_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43821568)))];
            tensor<fp16, []> obj_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> obj_5_cast_fp16 = batch_norm(beta = obj_5_beta_0_to_fp16, epsilon = obj_5_epsilon_0_to_fp16, gamma = obj_5_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_5_cast_fp16)[name = tensor<string, []>("obj_5_cast_fp16")];
            tensor<int32, [2]> var_331 = const()[name = tensor<string, []>("op_331"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_333 = const()[name = tensor<string, []>("op_333"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> query_3_pad_type_0 = const()[name = tensor<string, []>("query_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> query_3_pad_0 = const()[name = tensor<string, []>("query_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43824192)))];
            tensor<fp16, [1280]> layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47101056)))];
            tensor<fp16, [1, 1280, 1, 1500]> query_3_cast_fp16 = conv(bias = layers_1_self_attn_q_proj_bias_to_fp16, dilations = var_333, groups = var_298, pad = query_3_pad_0, pad_type = query_3_pad_type_0, strides = var_331, weight = layers_1_self_attn_q_proj_weight_to_fp16, x = obj_5_cast_fp16)[name = tensor<string, []>("query_3_cast_fp16")];
            tensor<int32, [2]> var_337 = const()[name = tensor<string, []>("op_337"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_339 = const()[name = tensor<string, []>("op_339"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> key_3_pad_type_0 = const()[name = tensor<string, []>("key_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> key_3_pad_0 = const()[name = tensor<string, []>("key_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47103680))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47922944))), name = tensor<string, []>("layers_1_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> key_3_cast_fp16 = conv(dilations = var_339, groups = var_298, pad = key_3_pad_0, pad_type = key_3_pad_type_0, strides = var_337, weight = layers_1_self_attn_k_proj_weight_to_fp16_palettized, x = obj_5_cast_fp16)[name = tensor<string, []>("key_3_cast_fp16")];
            tensor<int32, [2]> var_344 = const()[name = tensor<string, []>("op_344"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_346 = const()[name = tensor<string, []>("op_346"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> value_3_pad_type_0 = const()[name = tensor<string, []>("value_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> value_3_pad_0 = const()[name = tensor<string, []>("value_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47923072))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48742336))), name = tensor<string, []>("layers_1_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48742464)))];
            tensor<fp16, [1, 1280, 1, 1500]> value_3_cast_fp16 = conv(bias = layers_1_self_attn_v_proj_bias_to_fp16, dilations = var_346, groups = var_298, pad = value_3_pad_0, pad_type = value_3_pad_type_0, strides = var_344, weight = layers_1_self_attn_v_proj_weight_to_fp16_palettized, x = obj_5_cast_fp16)[name = tensor<string, []>("value_3_cast_fp16")];
            tensor<int32, [4]> var_350 = const()[name = tensor<string, []>("op_350"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_351_cast_fp16 = reshape(shape = var_350, x = query_3_cast_fp16)[name = tensor<string, []>("op_351_cast_fp16")];
            tensor<fp16, []> var_352_to_fp16 = const()[name = tensor<string, []>("op_352_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 20, 64, 1500]> var_353_cast_fp16 = mul(x = var_351_cast_fp16, y = var_352_to_fp16)[name = tensor<string, []>("op_353_cast_fp16")];
            tensor<int32, [4]> var_354 = const()[name = tensor<string, []>("op_354"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_355_cast_fp16 = reshape(shape = var_354, x = key_3_cast_fp16)[name = tensor<string, []>("op_355_cast_fp16")];
            tensor<bool, []> mh_w_3_transpose_x_0 = const()[name = tensor<string, []>("mh_w_3_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_3_transpose_y_0 = const()[name = tensor<string, []>("mh_w_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 1500]> mh_w_3_cast_fp16 = matmul(transpose_x = mh_w_3_transpose_x_0, transpose_y = mh_w_3_transpose_y_0, x = var_353_cast_fp16, y = var_355_cast_fp16)[name = tensor<string, []>("mh_w_3_cast_fp16")];
            tensor<fp16, [1, 20, 1500, 1500]> var_358_cast_fp16 = softmax(axis = var_296, x = mh_w_3_cast_fp16)[name = tensor<string, []>("op_358_cast_fp16")];
            tensor<int32, [4]> var_359 = const()[name = tensor<string, []>("op_359"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_360_cast_fp16 = reshape(shape = var_359, x = value_3_cast_fp16)[name = tensor<string, []>("op_360_cast_fp16")];
            tensor<bool, []> attn_3_transpose_x_0 = const()[name = tensor<string, []>("attn_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_3_transpose_y_0 = const()[name = tensor<string, []>("attn_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 20, 64, 1500]> attn_3_cast_fp16 = matmul(transpose_x = attn_3_transpose_x_0, transpose_y = attn_3_transpose_y_0, x = var_360_cast_fp16, y = var_358_cast_fp16)[name = tensor<string, []>("attn_3_cast_fp16")];
            tensor<int32, [4]> var_363 = const()[name = tensor<string, []>("op_363"), val = tensor<int32, [4]>([1, 1280, 1, -1])];
            tensor<fp16, [1, 1280, 1, 1500]> input_9_cast_fp16 = reshape(shape = var_363, x = attn_3_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [2]> var_367 = const()[name = tensor<string, []>("op_367"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_369 = const()[name = tensor<string, []>("op_369"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> obj_7_pad_type_0 = const()[name = tensor<string, []>("obj_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> obj_7_pad_0 = const()[name = tensor<string, []>("obj_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_o_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_o_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48745088)))];
            tensor<fp16, [1280]> layers_1_self_attn_o_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_o_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52021952)))];
            tensor<fp16, [1, 1280, 1, 1500]> obj_7_cast_fp16 = conv(bias = layers_1_self_attn_o_proj_bias_to_fp16, dilations = var_369, groups = var_298, pad = obj_7_pad_0, pad_type = obj_7_pad_type_0, strides = var_367, weight = layers_1_self_attn_o_proj_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("obj_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_7_cast_fp16 = add(x = inputs_5_cast_fp16, y = obj_7_cast_fp16)[name = tensor<string, []>("inputs_7_cast_fp16")];
            tensor<int32, [1]> var_375 = const()[name = tensor<string, []>("op_375"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_7_cast_fp16 = reduce_mean(axes = var_375, keep_dims = var_299, x = inputs_7_cast_fp16)[name = tensor<string, []>("channels_mean_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_7_cast_fp16 = sub(x = inputs_7_cast_fp16, y = channels_mean_7_cast_fp16)[name = tensor<string, []>("zero_mean_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_sq_7_cast_fp16 = mul(x = zero_mean_7_cast_fp16, y = zero_mean_7_cast_fp16)[name = tensor<string, []>("zero_mean_sq_7_cast_fp16")];
            tensor<int32, [1]> var_379 = const()[name = tensor<string, []>("op_379"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_380_cast_fp16 = reduce_mean(axes = var_379, keep_dims = var_299, x = zero_mean_sq_7_cast_fp16)[name = tensor<string, []>("op_380_cast_fp16")];
            tensor<fp16, []> var_381_to_fp16 = const()[name = tensor<string, []>("op_381_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_382_cast_fp16 = add(x = var_380_cast_fp16, y = var_381_to_fp16)[name = tensor<string, []>("op_382_cast_fp16")];
            tensor<fp32, []> denom_7_epsilon_0 = const()[name = tensor<string, []>("denom_7_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_7_cast_fp16 = rsqrt(epsilon = denom_7_epsilon_0, x = var_382_cast_fp16)[name = tensor<string, []>("denom_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> out_7_cast_fp16 = mul(x = zero_mean_7_cast_fp16, y = denom_7_cast_fp16)[name = tensor<string, []>("out_7_cast_fp16")];
            tensor<fp16, [1280]> input_11_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_11_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52024576)))];
            tensor<fp16, [1280]> input_11_beta_0_to_fp16 = const()[name = tensor<string, []>("input_11_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52027200)))];
            tensor<fp16, []> input_11_epsilon_0_to_fp16 = const()[name = tensor<string, []>("input_11_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> input_11_cast_fp16 = batch_norm(beta = input_11_beta_0_to_fp16, epsilon = input_11_epsilon_0_to_fp16, gamma = input_11_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_7_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [2]> var_393 = const()[name = tensor<string, []>("op_393"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_395 = const()[name = tensor<string, []>("op_395"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [5120, 1280, 1, 1]> layers_1_fc1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3276800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52029824))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55306688))), name = tensor<string, []>("layers_1_fc1_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([5120, 1280, 1, 1])];
            tensor<fp16, [5120]> layers_1_fc1_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_fc1_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55306816)))];
            tensor<fp16, [1, 5120, 1, 1500]> input_13_cast_fp16 = conv(bias = layers_1_fc1_bias_to_fp16, dilations = var_395, groups = var_298, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_393, weight = layers_1_fc1_weight_to_fp16_palettized, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> input_15_mode_0 = const()[name = tensor<string, []>("input_15_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 5120, 1, 1500]> input_15_cast_fp16 = gelu(mode = input_15_mode_0, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [2]> var_401 = const()[name = tensor<string, []>("op_401"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_403 = const()[name = tensor<string, []>("op_403"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_7_pad_type_0 = const()[name = tensor<string, []>("hidden_states_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_7_pad_0 = const()[name = tensor<string, []>("hidden_states_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 5120, 1, 1]> layers_1_fc2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3276800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55317120))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58593984))), name = tensor<string, []>("layers_1_fc2_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 5120, 1, 1])];
            tensor<fp16, [1280]> layers_1_fc2_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_fc2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58594112)))];
            tensor<fp16, [1, 1280, 1, 1500]> hidden_states_7_cast_fp16 = conv(bias = layers_1_fc2_bias_to_fp16, dilations = var_403, groups = var_298, pad = hidden_states_7_pad_0, pad_type = hidden_states_7_pad_type_0, strides = var_401, weight = layers_1_fc2_weight_to_fp16_palettized, x = input_15_cast_fp16)[name = tensor<string, []>("hidden_states_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_9_cast_fp16 = add(x = inputs_7_cast_fp16, y = hidden_states_7_cast_fp16)[name = tensor<string, []>("inputs_9_cast_fp16")];
            tensor<int32, []> var_414 = const()[name = tensor<string, []>("op_414"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_416 = const()[name = tensor<string, []>("op_416"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_417 = const()[name = tensor<string, []>("op_417"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_427 = const()[name = tensor<string, []>("op_427"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_9_cast_fp16 = reduce_mean(axes = var_427, keep_dims = var_417, x = inputs_9_cast_fp16)[name = tensor<string, []>("channels_mean_9_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_9_cast_fp16 = sub(x = inputs_9_cast_fp16, y = channels_mean_9_cast_fp16)[name = tensor<string, []>("zero_mean_9_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> zero_mean_sq_9_cast_fp16 = mul(x = zero_mean_9_cast_fp16, y = zero_mean_9_cast_fp16)[name = tensor<string, []>("zero_mean_sq_9_cast_fp16")];
            tensor<int32, [1]> var_431 = const()[name = tensor<string, []>("op_431"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_432_cast_fp16 = reduce_mean(axes = var_431, keep_dims = var_417, x = zero_mean_sq_9_cast_fp16)[name = tensor<string, []>("op_432_cast_fp16")];
            tensor<fp16, []> var_433_to_fp16 = const()[name = tensor<string, []>("op_433_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_434_cast_fp16 = add(x = var_432_cast_fp16, y = var_433_to_fp16)[name = tensor<string, []>("op_434_cast_fp16")];
            tensor<fp32, []> denom_9_epsilon_0 = const()[name = tensor<string, []>("denom_9_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1500]> denom_9_cast_fp16 = rsqrt(epsilon = denom_9_epsilon_0, x = var_434_cast_fp16)[name = tensor<string, []>("denom_9_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> out_9_cast_fp16 = mul(x = zero_mean_9_cast_fp16, y = denom_9_cast_fp16)[name = tensor<string, []>("out_9_cast_fp16")];
            tensor<fp16, [1280]> obj_9_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_9_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58596736)))];
            tensor<fp16, [1280]> obj_9_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_9_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58599360)))];
            tensor<fp16, []> obj_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> obj_9_cast_fp16 = batch_norm(beta = obj_9_beta_0_to_fp16, epsilon = obj_9_epsilon_0_to_fp16, gamma = obj_9_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_9_cast_fp16)[name = tensor<string, []>("obj_9_cast_fp16")];
            tensor<int32, [2]> var_449 = const()[name = tensor<string, []>("op_449"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_451 = const()[name = tensor<string, []>("op_451"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> query_5_pad_type_0 = const()[name = tensor<string, []>("query_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> query_5_pad_0 = const()[name = tensor<string, []>("query_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_2_self_attn_q_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58601984))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(59421248))), name = tensor<string, []>("layers_2_self_attn_q_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(59421376)))];
            tensor<fp16, [1, 1280, 1, 1500]> query_5_cast_fp16 = conv(bias = layers_2_self_attn_q_proj_bias_to_fp16, dilations = var_451, groups = var_416, pad = query_5_pad_0, pad_type = query_5_pad_type_0, strides = var_449, weight = layers_2_self_attn_q_proj_weight_to_fp16_palettized, x = obj_9_cast_fp16)[name = tensor<string, []>("query_5_cast_fp16")];
            tensor<int32, [2]> var_455 = const()[name = tensor<string, []>("op_455"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_457 = const()[name = tensor<string, []>("op_457"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> key_5_pad_type_0 = const()[name = tensor<string, []>("key_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> key_5_pad_0 = const()[name = tensor<string, []>("key_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_2_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(59424000))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60243264))), name = tensor<string, []>("layers_2_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> key_5_cast_fp16 = conv(dilations = var_457, groups = var_416, pad = key_5_pad_0, pad_type = key_5_pad_type_0, strides = var_455, weight = layers_2_self_attn_k_proj_weight_to_fp16_palettized, x = obj_9_cast_fp16)[name = tensor<string, []>("key_5_cast_fp16")];
            tensor<int32, [2]> var_462 = const()[name = tensor<string, []>("op_462"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_464 = const()[name = tensor<string, []>("op_464"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> value_5_pad_type_0 = const()[name = tensor<string, []>("value_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> value_5_pad_0 = const()[name = tensor<string, []>("value_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_2_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60243392))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61062656))), name = tensor<string, []>("layers_2_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61062784)))];
            tensor<fp16, [1, 1280, 1, 1500]> value_5_cast_fp16 = conv(bias = layers_2_self_attn_v_proj_bias_to_fp16, dilations = var_464, groups = var_416, pad = value_5_pad_0, pad_type = value_5_pad_type_0, strides = var_462, weight = layers_2_self_attn_v_proj_weight_to_fp16_palettized, x = obj_9_cast_fp16)[name = tensor<string, []>("value_5_cast_fp16")];
            tensor<int32, [4]> var_468 = const()[name = tensor<string, []>("op_468"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_469_cast_fp16 = reshape(shape = var_468, x = query_5_cast_fp16)[name = tensor<string, []>("op_469_cast_fp16")];
