program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3304.5.2"}, {"coremlc-version", "3304.6.2"}})]
{
    func main<ios17>(tensor<int32, [1]> cache_length, tensor<fp16, [1, 448]> decoder_key_padding_mask, tensor<fp16, [1, 1280, 1, 1500]> encoder_output_embeds, tensor<int32, [1]> input_ids, tensor<fp16, [1, 40960, 1, 448]> key_cache, tensor<fp16, [1, 448]> kv_cache_update_mask, tensor<fp16, [1, 40960, 1, 448]> value_cache) {
            tensor<int32, []> var_80_axis_0 = const()[name = tensor<string, []>("op_80_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> var_80_batch_dims_0 = const()[name = tensor<string, []>("op_80_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> var_80_validate_indices_0 = const()[name = tensor<string, []>("op_80_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [51866, 1280]> embed_tokens_weight_to_fp16 = const()[name = tensor<string, []>("embed_tokens_weight_to_fp16"), val = tensor<fp16, [51866, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 1280]> var_80_cast_fp16 = gather(axis = var_80_axis_0, batch_dims = var_80_batch_dims_0, indices = input_ids, validate_indices = var_80_validate_indices_0, x = embed_tokens_weight_to_fp16)[name = tensor<string, []>("op_80_cast_fp16")];
            tensor<int32, []> var_84_axis_0 = const()[name = tensor<string, []>("op_84_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> var_84_batch_dims_0 = const()[name = tensor<string, []>("op_84_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> var_84_validate_indices_0 = const()[name = tensor<string, []>("op_84_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [448, 1280]> embed_positions_weight_to_fp16 = const()[name = tensor<string, []>("embed_positions_weight_to_fp16"), val = tensor<fp16, [448, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132777088)))];
            tensor<string, []> cache_length_to_int16_dtype_0 = const()[name = tensor<string, []>("cache_length_to_int16_dtype_0"), val = tensor<string, []>("int16")];
            tensor<int16, [1]> cast_0 = cast(dtype = cache_length_to_int16_dtype_0, x = cache_length)[name = tensor<string, []>("cast_0")];
            tensor<fp16, [1, 1280]> var_84_cast_fp16_cast_int16 = gather(axis = var_84_axis_0, batch_dims = var_84_batch_dims_0, indices = cast_0, validate_indices = var_84_validate_indices_0, x = embed_positions_weight_to_fp16)[name = tensor<string, []>("op_84_cast_fp16_cast_int16")];
            tensor<fp16, [1, 1280]> hidden_states_1_cast_fp16 = add(x = var_80_cast_fp16, y = var_84_cast_fp16_cast_int16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<int32, [1]> var_98_axes_0 = const()[name = tensor<string, []>("op_98_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1280, 1]> var_98_cast_fp16 = expand_dims(axes = var_98_axes_0, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_98_cast_fp16")];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 1280, 1, 1]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_98_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, [32]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [32]>([1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280])];
            tensor<int32, []> var_103_axis_0 = const()[name = tensor<string, []>("op_103_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_0, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_1, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_2, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_3, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_4, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_5, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_6, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_7, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_8, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_9, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_10, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_11, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_12, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_13, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_14, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_15, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_16, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_17, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_18, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_19, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_20, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_21, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_22, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_23, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_24, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_25, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_26, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_27, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_28, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_29, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_30, tensor<fp16, [1, 1280, 1, 448]> var_103_cast_fp16_31 = split(axis = var_103_axis_0, split_sizes = tile_0, x = key_cache)[name = tensor<string, []>("op_103_cast_fp16")];
            tensor<int32, [32]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [32]>([1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280, 1280])];
            tensor<int32, []> var_138_axis_0 = const()[name = tensor<string, []>("op_138_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_0, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_1, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_2, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_3, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_4, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_5, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_6, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_7, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_8, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_9, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_10, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_11, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_12, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_13, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_14, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_15, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_16, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_17, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_18, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_19, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_20, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_21, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_22, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_23, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_24, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_25, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_26, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_27, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_28, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_29, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_30, tensor<fp16, [1, 1280, 1, 448]> var_138_cast_fp16_31 = split(axis = var_138_axis_0, split_sizes = tile_1, x = value_cache)[name = tensor<string, []>("op_138_cast_fp16")];
            tensor<int32, []> var_176 = const()[name = tensor<string, []>("op_176"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_183 = const()[name = tensor<string, []>("op_183"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_184 = const()[name = tensor<string, []>("op_184"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_196 = const()[name = tensor<string, []>("op_196"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> channels_mean_1_cast_fp16 = reduce_mean(axes = var_196, keep_dims = var_184, x = inputs_1_cast_fp16)[name = tensor<string, []>("channels_mean_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> zero_mean_1_cast_fp16 = sub(x = inputs_1_cast_fp16, y = channels_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> zero_mean_sq_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = zero_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_sq_1_cast_fp16")];
            tensor<int32, [1]> var_200 = const()[name = tensor<string, []>("op_200"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> var_201_cast_fp16 = reduce_mean(axes = var_200, keep_dims = var_184, x = zero_mean_sq_1_cast_fp16)[name = tensor<string, []>("op_201_cast_fp16")];
            tensor<fp16, []> var_202_to_fp16 = const()[name = tensor<string, []>("op_202_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1]> var_203_cast_fp16 = add(x = var_201_cast_fp16, y = var_202_to_fp16)[name = tensor<string, []>("op_203_cast_fp16")];
            tensor<fp32, []> denom_1_epsilon_0 = const()[name = tensor<string, []>("denom_1_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1]> denom_1_cast_fp16 = rsqrt(epsilon = denom_1_epsilon_0, x = var_203_cast_fp16)[name = tensor<string, []>("denom_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> out_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = denom_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [1280]> obj_1_mean_0_to_fp16 = const()[name = tensor<string, []>("obj_1_mean_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133924032)))];
            tensor<fp16, [1280]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133926656)))];
            tensor<fp16, [1280]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133929280)))];
            tensor<fp16, [1280]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133931904)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<int32, [2]> var_221 = const()[name = tensor<string, []>("op_221"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_223 = const()[name = tensor<string, []>("op_223"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_1_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_1_pad_0 = const()[name = tensor<string, []>("pretrained_out_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_q_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133934528))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134753792))), name = tensor<string, []>("layers_0_self_attn_q_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_q_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134753920)))];
            tensor<fp16, [1, 1280, 1, 1]> pretrained_out_1_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_pretrained_bias_to_fp16, dilations = var_223, groups = var_183, pad = pretrained_out_1_pad_0, pad_type = pretrained_out_1_pad_type_0, strides = var_221, weight = layers_0_self_attn_q_proj_pretrained_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("pretrained_out_1_cast_fp16")];
            tensor<int32, [2]> var_227 = const()[name = tensor<string, []>("op_227"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_229 = const()[name = tensor<string, []>("op_229"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_self_attn_q_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134756544)))];
            tensor<fp16, [1, 16, 1, 1]> input_1_cast_fp16 = conv(dilations = var_229, groups = var_183, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_227, weight = layers_0_self_attn_q_proj_loraA_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [2]> var_233 = const()[name = tensor<string, []>("op_233"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_235 = const()[name = tensor<string, []>("op_235"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_1_pad_type_0 = const()[name = tensor<string, []>("lora_out_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_1_pad_0 = const()[name = tensor<string, []>("lora_out_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_3_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_3_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134797568)))];
            tensor<fp16, [1, 1280, 1, 1]> lora_out_3_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_235, groups = var_183, pad = lora_out_1_pad_0, pad_type = lora_out_1_pad_type_0, strides = var_233, weight = lora_out_3_weight_0_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("lora_out_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> query_1_cast_fp16 = add(x = pretrained_out_1_cast_fp16, y = lora_out_3_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<int32, [2]> var_245 = const()[name = tensor<string, []>("op_245"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_247 = const()[name = tensor<string, []>("op_247"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_3_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_3_pad_0 = const()[name = tensor<string, []>("pretrained_out_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_k_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134838592))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135657856))), name = tensor<string, []>("layers_0_self_attn_k_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1]> pretrained_out_3_cast_fp16 = conv(dilations = var_247, groups = var_183, pad = pretrained_out_3_pad_0, pad_type = pretrained_out_3_pad_type_0, strides = var_245, weight = layers_0_self_attn_k_proj_pretrained_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("pretrained_out_3_cast_fp16")];
            tensor<int32, [2]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_253 = const()[name = tensor<string, []>("op_253"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_self_attn_k_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_k_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135657984)))];
            tensor<fp16, [1, 16, 1, 1]> input_3_cast_fp16 = conv(dilations = var_253, groups = var_183, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_251, weight = layers_0_self_attn_k_proj_loraA_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [2]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_259 = const()[name = tensor<string, []>("op_259"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_5_pad_type_0 = const()[name = tensor<string, []>("lora_out_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_5_pad_0 = const()[name = tensor<string, []>("lora_out_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_7_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_7_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135699008)))];
            tensor<fp16, [1, 1280, 1, 1]> lora_out_7_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_259, groups = var_183, pad = lora_out_5_pad_0, pad_type = lora_out_5_pad_type_0, strides = var_257, weight = lora_out_7_weight_0_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("lora_out_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> current_key_1_cast_fp16 = add(x = pretrained_out_3_cast_fp16, y = lora_out_7_cast_fp16)[name = tensor<string, []>("current_key_1_cast_fp16")];
            tensor<int32, [2]> var_270 = const()[name = tensor<string, []>("op_270"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_272 = const()[name = tensor<string, []>("op_272"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_5_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_5_pad_0 = const()[name = tensor<string, []>("pretrained_out_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_v_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135740032))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136559296))), name = tensor<string, []>("layers_0_self_attn_v_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_v_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136559424)))];
            tensor<fp16, [1, 1280, 1, 1]> pretrained_out_5_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_pretrained_bias_to_fp16, dilations = var_272, groups = var_183, pad = pretrained_out_5_pad_0, pad_type = pretrained_out_5_pad_type_0, strides = var_270, weight = layers_0_self_attn_v_proj_pretrained_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("pretrained_out_5_cast_fp16")];
            tensor<int32, [2]> var_276 = const()[name = tensor<string, []>("op_276"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_278 = const()[name = tensor<string, []>("op_278"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_self_attn_v_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136562048)))];
            tensor<fp16, [1, 16, 1, 1]> input_5_cast_fp16 = conv(dilations = var_278, groups = var_183, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = var_276, weight = layers_0_self_attn_v_proj_loraA_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [2]> var_282 = const()[name = tensor<string, []>("op_282"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_284 = const()[name = tensor<string, []>("op_284"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_9_pad_type_0 = const()[name = tensor<string, []>("lora_out_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_9_pad_0 = const()[name = tensor<string, []>("lora_out_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_11_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_11_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136603072)))];
            tensor<fp16, [1, 1280, 1, 1]> lora_out_11_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_284, groups = var_183, pad = lora_out_9_pad_0, pad_type = lora_out_9_pad_type_0, strides = var_282, weight = lora_out_11_weight_0_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("lora_out_11_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> current_value_1_cast_fp16 = add(x = pretrained_out_5_cast_fp16, y = lora_out_11_cast_fp16)[name = tensor<string, []>("current_value_1_cast_fp16")];
            tensor<int32, [1]> var_291_axes_0 = const()[name = tensor<string, []>("op_291_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 448]> var_291_cast_fp16 = expand_dims(axes = var_291_axes_0, x = kv_cache_update_mask)[name = tensor<string, []>("op_291_cast_fp16")];
            tensor<int32, [1]> var_292_axes_0 = const()[name = tensor<string, []>("op_292_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1, 1, 448]> var_292_cast_fp16 = expand_dims(axes = var_292_axes_0, x = var_291_cast_fp16)[name = tensor<string, []>("op_292_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> var_294_cast_fp16 = mul(x = current_key_1_cast_fp16, y = var_292_cast_fp16)[name = tensor<string, []>("op_294_cast_fp16")];
            tensor<fp16, []> var_177_to_fp16 = const()[name = tensor<string, []>("op_177_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 1, 1, 448]> var_295_cast_fp16 = sub(x = var_177_to_fp16, y = var_292_cast_fp16)[name = tensor<string, []>("op_295_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> var_296_cast_fp16 = mul(x = var_103_cast_fp16_0, y = var_295_cast_fp16)[name = tensor<string, []>("op_296_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> key_1_cast_fp16 = add(x = var_294_cast_fp16, y = var_296_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> var_298_cast_fp16 = mul(x = current_value_1_cast_fp16, y = var_292_cast_fp16)[name = tensor<string, []>("op_298_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> var_300_cast_fp16 = mul(x = var_138_cast_fp16_0, y = var_295_cast_fp16)[name = tensor<string, []>("op_300_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> value_1_cast_fp16 = add(x = var_298_cast_fp16, y = var_300_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_303 = const()[name = tensor<string, []>("op_303"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1]> var_304_cast_fp16 = reshape(shape = var_303, x = query_1_cast_fp16)[name = tensor<string, []>("op_304_cast_fp16")];
            tensor<fp16, []> var_305_to_fp16 = const()[name = tensor<string, []>("op_305_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 20, 64, 1]> var_306_cast_fp16 = mul(x = var_304_cast_fp16, y = var_305_to_fp16)[name = tensor<string, []>("op_306_cast_fp16")];
            tensor<int32, [4]> var_307 = const()[name = tensor<string, []>("op_307"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 448]> var_308_cast_fp16 = reshape(shape = var_307, x = key_1_cast_fp16)[name = tensor<string, []>("op_308_cast_fp16")];
            tensor<bool, []> mh_w_1_transpose_x_0 = const()[name = tensor<string, []>("mh_w_1_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_1_transpose_y_0 = const()[name = tensor<string, []>("mh_w_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1, 448]> mh_w_1_cast_fp16 = matmul(transpose_x = mh_w_1_transpose_x_0, transpose_y = mh_w_1_transpose_y_0, x = var_306_cast_fp16, y = var_308_cast_fp16)[name = tensor<string, []>("mh_w_1_cast_fp16")];
            tensor<int32, [1]> var_312_axes_0 = const()[name = tensor<string, []>("op_312_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 448]> var_312_cast_fp16 = expand_dims(axes = var_312_axes_0, x = decoder_key_padding_mask)[name = tensor<string, []>("op_312_cast_fp16")];
            tensor<int32, [1]> var_313_axes_0 = const()[name = tensor<string, []>("op_313_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1, 1, 448]> var_313_cast_fp16 = expand_dims(axes = var_313_axes_0, x = var_312_cast_fp16)[name = tensor<string, []>("op_313_cast_fp16")];
            tensor<fp16, [1, 20, 1, 448]> mh_w_3_cast_fp16 = add(x = mh_w_1_cast_fp16, y = var_313_cast_fp16)[name = tensor<string, []>("mh_w_3_cast_fp16")];
            tensor<fp16, [1, 20, 1, 448]> var_316_cast_fp16 = softmax(axis = var_176, x = mh_w_3_cast_fp16)[name = tensor<string, []>("op_316_cast_fp16")];
            tensor<int32, [4]> var_317 = const()[name = tensor<string, []>("op_317"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 448]> var_318_cast_fp16 = reshape(shape = var_317, x = value_1_cast_fp16)[name = tensor<string, []>("op_318_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_0 = const()[name = tensor<string, []>("attn_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_0 = const()[name = tensor<string, []>("attn_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 20, 64, 1]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_0, transpose_y = attn_1_transpose_y_0, x = var_318_cast_fp16, y = var_316_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<int32, [4]> var_321 = const()[name = tensor<string, []>("op_321"), val = tensor<int32, [4]>([1, 1280, 1, -1])];
            tensor<fp16, [1, 1280, 1, 1]> input_7_cast_fp16 = reshape(shape = var_321, x = attn_1_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [2]> var_328 = const()[name = tensor<string, []>("op_328"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_330 = const()[name = tensor<string, []>("op_330"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_7_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_7_pad_0 = const()[name = tensor<string, []>("pretrained_out_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_o_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136644096))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137463360))), name = tensor<string, []>("layers_0_self_attn_o_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_o_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137463488)))];
            tensor<fp16, [1, 1280, 1, 1]> pretrained_out_7_cast_fp16 = conv(bias = layers_0_self_attn_o_proj_pretrained_bias_to_fp16, dilations = var_330, groups = var_183, pad = pretrained_out_7_pad_0, pad_type = pretrained_out_7_pad_type_0, strides = var_328, weight = layers_0_self_attn_o_proj_pretrained_weight_to_fp16_palettized, x = input_7_cast_fp16)[name = tensor<string, []>("pretrained_out_7_cast_fp16")];
            tensor<int32, [2]> var_334 = const()[name = tensor<string, []>("op_334"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_336 = const()[name = tensor<string, []>("op_336"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_self_attn_o_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137466112)))];
            tensor<fp16, [1, 16, 1, 1]> input_9_cast_fp16 = conv(dilations = var_336, groups = var_183, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_334, weight = layers_0_self_attn_o_proj_loraA_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [2]> var_340 = const()[name = tensor<string, []>("op_340"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_342 = const()[name = tensor<string, []>("op_342"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_13_pad_type_0 = const()[name = tensor<string, []>("lora_out_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_13_pad_0 = const()[name = tensor<string, []>("lora_out_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_15_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_15_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137507136)))];
            tensor<fp16, [1, 1280, 1, 1]> lora_out_15_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_342, groups = var_183, pad = lora_out_13_pad_0, pad_type = lora_out_13_pad_type_0, strides = var_340, weight = lora_out_15_weight_0_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("lora_out_15_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> obj_7_cast_fp16 = add(x = pretrained_out_7_cast_fp16, y = lora_out_15_cast_fp16)[name = tensor<string, []>("obj_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = obj_7_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> var_355 = const()[name = tensor<string, []>("op_355"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> channels_mean_3_cast_fp16 = reduce_mean(axes = var_355, keep_dims = var_184, x = inputs_3_cast_fp16)[name = tensor<string, []>("channels_mean_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> zero_mean_3_cast_fp16 = sub(x = inputs_3_cast_fp16, y = channels_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> zero_mean_sq_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = zero_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_sq_3_cast_fp16")];
            tensor<int32, [1]> var_359 = const()[name = tensor<string, []>("op_359"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1]> var_360_cast_fp16 = reduce_mean(axes = var_359, keep_dims = var_184, x = zero_mean_sq_3_cast_fp16)[name = tensor<string, []>("op_360_cast_fp16")];
            tensor<fp16, []> var_361_to_fp16 = const()[name = tensor<string, []>("op_361_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1]> var_362_cast_fp16 = add(x = var_360_cast_fp16, y = var_361_to_fp16)[name = tensor<string, []>("op_362_cast_fp16")];
            tensor<fp32, []> denom_3_epsilon_0 = const()[name = tensor<string, []>("denom_3_epsilon_0"), val = tensor<fp32, []>(0x1.197998p-40)];
            tensor<fp16, [1, 1, 1, 1]> denom_3_cast_fp16 = rsqrt(epsilon = denom_3_epsilon_0, x = var_362_cast_fp16)[name = tensor<string, []>("denom_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> out_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = denom_3_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [1280]> obj_9_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_9_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137548160)))];
            tensor<fp16, [1280]> obj_9_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_9_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137550784)))];
            tensor<fp16, []> obj_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1]> obj_9_cast_fp16 = batch_norm(beta = obj_9_beta_0_to_fp16, epsilon = obj_9_epsilon_0_to_fp16, gamma = obj_9_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_3_cast_fp16)[name = tensor<string, []>("obj_9_cast_fp16")];
            tensor<int32, [2]> var_380 = const()[name = tensor<string, []>("op_380"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_382 = const()[name = tensor<string, []>("op_382"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_9_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_9_pad_0 = const()[name = tensor<string, []>("pretrained_out_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_q_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137553408))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138372672))), name = tensor<string, []>("layers_0_encoder_attn_q_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_encoder_attn_q_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_q_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138372800)))];
            tensor<fp16, [1, 1280, 1, 1]> pretrained_out_9_cast_fp16 = conv(bias = layers_0_encoder_attn_q_proj_pretrained_bias_to_fp16, dilations = var_382, groups = var_183, pad = pretrained_out_9_pad_0, pad_type = pretrained_out_9_pad_type_0, strides = var_380, weight = layers_0_encoder_attn_q_proj_pretrained_weight_to_fp16_palettized, x = obj_9_cast_fp16)[name = tensor<string, []>("pretrained_out_9_cast_fp16")];
            tensor<int32, [2]> var_386 = const()[name = tensor<string, []>("op_386"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_388 = const()[name = tensor<string, []>("op_388"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_encoder_attn_q_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_q_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138375424)))];
            tensor<fp16, [1, 16, 1, 1]> input_11_cast_fp16 = conv(dilations = var_388, groups = var_183, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = var_386, weight = layers_0_encoder_attn_q_proj_loraA_weight_to_fp16, x = obj_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [2]> var_392 = const()[name = tensor<string, []>("op_392"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_394 = const()[name = tensor<string, []>("op_394"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_17_pad_type_0 = const()[name = tensor<string, []>("lora_out_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_17_pad_0 = const()[name = tensor<string, []>("lora_out_17_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_19_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_19_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138416448)))];
            tensor<fp16, [1, 1280, 1, 1]> lora_out_19_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_394, groups = var_183, pad = lora_out_17_pad_0, pad_type = lora_out_17_pad_type_0, strides = var_392, weight = lora_out_19_weight_0_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("lora_out_19_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> query_3_cast_fp16 = add(x = pretrained_out_9_cast_fp16, y = lora_out_19_cast_fp16)[name = tensor<string, []>("query_3_cast_fp16")];
            tensor<int32, [2]> var_404 = const()[name = tensor<string, []>("op_404"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_406 = const()[name = tensor<string, []>("op_406"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_11_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_11_pad_0 = const()[name = tensor<string, []>("pretrained_out_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_k_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138457472))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139276736))), name = tensor<string, []>("layers_0_encoder_attn_k_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_11_cast_fp16 = conv(dilations = var_406, groups = var_183, pad = pretrained_out_11_pad_0, pad_type = pretrained_out_11_pad_type_0, strides = var_404, weight = layers_0_encoder_attn_k_proj_pretrained_weight_to_fp16_palettized, x = encoder_output_embeds)[name = tensor<string, []>("pretrained_out_11_cast_fp16")];
            tensor<int32, [2]> var_410 = const()[name = tensor<string, []>("op_410"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_412 = const()[name = tensor<string, []>("op_412"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_encoder_attn_k_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_k_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139276864)))];
            tensor<fp16, [1, 16, 1, 1500]> input_13_cast_fp16 = conv(dilations = var_412, groups = var_183, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_410, weight = layers_0_encoder_attn_k_proj_loraA_weight_to_fp16, x = encoder_output_embeds)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<int32, [2]> var_416 = const()[name = tensor<string, []>("op_416"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_418 = const()[name = tensor<string, []>("op_418"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_21_pad_type_0 = const()[name = tensor<string, []>("lora_out_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_21_pad_0 = const()[name = tensor<string, []>("lora_out_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_23_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_23_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139317888)))];
            tensor<fp16, [1, 1280, 1, 1500]> lora_out_23_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_418, groups = var_183, pad = lora_out_21_pad_0, pad_type = lora_out_21_pad_type_0, strides = var_416, weight = lora_out_23_weight_0_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("lora_out_23_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> key_3_cast_fp16 = add(x = pretrained_out_11_cast_fp16, y = lora_out_23_cast_fp16)[name = tensor<string, []>("key_3_cast_fp16")];
            tensor<int32, [2]> var_429 = const()[name = tensor<string, []>("op_429"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_431 = const()[name = tensor<string, []>("op_431"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> pretrained_out_13_pad_type_0 = const()[name = tensor<string, []>("pretrained_out_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> pretrained_out_13_pad_0 = const()[name = tensor<string, []>("pretrained_out_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_v_proj_pretrained_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139358912))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140178176))), name = tensor<string, []>("layers_0_encoder_attn_v_proj_pretrained_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_encoder_attn_v_proj_pretrained_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_v_proj_pretrained_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140178304)))];
            tensor<fp16, [1, 1280, 1, 1500]> pretrained_out_13_cast_fp16 = conv(bias = layers_0_encoder_attn_v_proj_pretrained_bias_to_fp16, dilations = var_431, groups = var_183, pad = pretrained_out_13_pad_0, pad_type = pretrained_out_13_pad_type_0, strides = var_429, weight = layers_0_encoder_attn_v_proj_pretrained_weight_to_fp16_palettized, x = encoder_output_embeds)[name = tensor<string, []>("pretrained_out_13_cast_fp16")];
            tensor<int32, [2]> var_435 = const()[name = tensor<string, []>("op_435"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_437 = const()[name = tensor<string, []>("op_437"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_15_pad_type_0 = const()[name = tensor<string, []>("input_15_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_15_pad_0 = const()[name = tensor<string, []>("input_15_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1280, 1, 1]> layers_0_encoder_attn_v_proj_loraA_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_v_proj_loraA_weight_to_fp16"), val = tensor<fp16, [16, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140180928)))];
            tensor<fp16, [1, 16, 1, 1500]> input_15_cast_fp16 = conv(dilations = var_437, groups = var_183, pad = input_15_pad_0, pad_type = input_15_pad_type_0, strides = var_435, weight = layers_0_encoder_attn_v_proj_loraA_weight_to_fp16, x = encoder_output_embeds)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [2]> var_441 = const()[name = tensor<string, []>("op_441"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_443 = const()[name = tensor<string, []>("op_443"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> lora_out_25_pad_type_0 = const()[name = tensor<string, []>("lora_out_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> lora_out_25_pad_0 = const()[name = tensor<string, []>("lora_out_25_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 16, 1, 1]> lora_out_27_weight_0_to_fp16 = const()[name = tensor<string, []>("lora_out_27_weight_0_to_fp16"), val = tensor<fp16, [1280, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140221952)))];
            tensor<fp16, [1, 1280, 1, 1500]> lora_out_27_cast_fp16 = conv(bias = obj_1_mean_0_to_fp16, dilations = var_443, groups = var_183, pad = lora_out_25_pad_0, pad_type = lora_out_25_pad_type_0, strides = var_441, weight = lora_out_27_weight_0_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("lora_out_27_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> value_3_cast_fp16 = add(x = pretrained_out_13_cast_fp16, y = lora_out_27_cast_fp16)[name = tensor<string, []>("value_3_cast_fp16")];
            tensor<int32, [4]> var_450 = const()[name = tensor<string, []>("op_450"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1]> var_451_cast_fp16 = reshape(shape = var_450, x = query_3_cast_fp16)[name = tensor<string, []>("op_451_cast_fp16")];
